<a href="https://colab.research.google.com/github/yash-rai22/Marketing-Campaign-for-Banking-Products/blob/master/MLproject.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#IMPORT DATASETS AND LIBRARIES
import pandas as pd
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
df = pd.read_excel("Bank_Personal_Loan_Modelling.xlsx")

In [ ]:
df.head()

   ID  Age  Experience  ...  CD Account  Online  CreditCard
0   1   25           1  ...           0       0           0
1   2   45          19  ...           0       0           0
2   3   39          15  ...           0       0           0
3   4   35           9  ...           0       0           0
4   5   35           8  ...           0       0           1

[5 rows x 14 columns]

In [ ]:
#SIZE OF THE DATASET (ROW,COLUMNS)
df.shape

(5000, 14)

In [ ]:
#DATATYPES OF EACH COLUMN OF THE DATASET
df.dtypes

ID                      int64
Age                     int64
Experience              int64
Income                  int64
ZIP Code                int64
Family                  int64
CCAvg                 float64
Education               int64
Mortgage                int64
Personal Loan           int64
Securities Account      int64
CD Account              int64
Online                  int64
CreditCard              int64
dtype: object

In [ ]:
#STATISTICAL SUMMARY OF THE DATASET
df.describe()

                ID          Age  ...       Online   CreditCard
count  5000.000000  5000.000000  ...  5000.000000  5000.000000
mean   2500.500000    45.338400  ...     0.596800     0.294000
std    1443.520003    11.463166  ...     0.490589     0.455637
min       1.000000    23.000000  ...     0.000000     0.000000
25%    1250.750000    35.000000  ...     0.000000     0.000000
50%    2500.500000    45.000000  ...     1.000000     0.000000
75%    3750.250000    55.000000  ...     1.000000     1.000000
max    5000.000000    67.000000  ...     1.000000     1.000000

[8 rows x 14 columns]

In [ ]:
#THERE ARE NO NULL VALUES PRESENT IN THE DATASET
df.isnull().values.any()

False

In [ ]:
#NUMBER OF UNIQUES IN EACH COLUMN
for col in df:
    print(col,':',df[col].nunique())

ID : 5000
Age : 45
Experience : 47
Income : 162
ZIP Code : 467
Family : 4
CCAvg : 108
Education : 3
Mortgage : 347
Personal Loan : 2
Securities Account : 2
CD Account : 2
Online : 2
CreditCard : 2

In [ ]:
#NMUBER OF PEOPLE WITH 0 MORTGAGE
count = 0
for i in df['Mortgage']:
  if i == 0:
      count += 1

print(count)

3462

In [ ]:
df['Mortgage'].isin([0]).sum()

3462

In [ ]:
df['CCAvg'].isin([0]).sum()

106